Repository: gideonthomasd/fluxbox
Catalog: wmalauncher-2020.0124/po/*.po
Languages: fr

source: Error %d: %s
fr: Erreur %d:%s

source: %d fonts found :
fr: %d police(s) trouvée(s) :

source: %s Activates execution of the command/application in a terminal window (see option %s).
fr: %s Active l'exécution de la commande/application dans une fenêtre de terminal (voir option %s).

source: %s Displays the icon in grayscale mode on mouse hovers.
fr: %s Affiche l'icône en niveau de gris lors du survol de la souris.

source: %s Displays the icon in grayscale mode.
fr: %s Affiche l'icône en niveau de gris.

source: %s Enables fix for "broken" window managers.
fr: %s Active le correctif pour les gestionnaires de fenêtres "à problèmes".

source: %s Prints this help page.
fr: %s Affiche la page d'aide.

source: %s Terminates this wmalauncher instance on right click.
fr: %s Termine cette instance de wmalauncher avec un clic-droit.

source: %s <CMD> %s <ICON> Sets the command to execute to <CMD> and the icon to display to <ICON>.
fr: %s <CMD> %s <ICON> Définit <CMD> comme étant la commmande à exécuter, et <ICON> comme étant l'icône à afficher.

source: %s <COLOR> Sets the tooltip foreground color to <COLOR>. Default to %s.
fr: %s <COLOR> Définit <COLOR> comme couleur d'avant plan de l'info-bulle. %s par défaut.

source: %s <COLOR|GRADIENT> Sets the background color on mouse hovers to the plain color <COLOR> or to the color gradient <GRADIENT>. Default to the plain color %s.
fr: %s <COLOR> Définit la couleur unie <COLOR> ou le dégradé de couleurs <GRADIENT> comme couleur d'arrière-plan lors du survol de la souris. Par défaut à la couleur unie %s.

source: %s <COLOR|GRADIENT> Sets the background color to the plain color <COLOR> or to the color gradient <GRADIENT>. Default to the plain color %s.
fr: %s <COLOR> Définit la couleur unie <COLOR> ou le dégradé de couleurs <GRADIENT> comme couleur d'arrière-plan. Par défaut à la couleur unie %s.

source: %s <COLOR|GRADIENT> Sets the tooltip background color to the plain color <COLOR> or to the color gradient <GRADIENT>. Default to the plain color %s.
fr: %s <COLOR> Définit la couleur unie <COLOR> ou le dégradé de couleurs <GRADIENT> comme couleur d'arrière plan de l'info-bulle. Par défaut à la couleur unie %s.

source: %s <COLOR|GRADIENT> Sets the window border color on mouse hovers to the plain color <COLOR> or to the color gradient <GRADIENT>. Default to the plain color %s.
fr: %s <COLOR> Définit la couleur unie <COLOR> ou le dégradé de couleurs <GRADIENT> comme couleur de la bordure lors du survol de la souris. Par défaut à la couleur unie %s.

source: %s <COLOR|GRADIENT> Sets the window border color to the plain color <COLOR> or to the color gradient <GRADIENT>. Default to the plain color %s.
fr: %s <COLOR> Définit la couleur unie <COLOR> ou le dégradé de couleurs <GRADIENT> comme couleur de la bordure. Par défaut à la couleur unie %s.

source: %s <DELAY> Sets the tooltip hide timing delay to <DELAY> ms. Default to %d ms.
fr: %s <DELAY> Fixe à <DELAY> milliseconde(s) le délai avant masquage de l'info-bulle. %d par défaut.

source: %s <DELAY> Sets the tooltip show timing delay to <DELAY> ms. Default to %d ms.
fr: %s <DELAY> Fixe à <DELAY> milliseconde(s) le délai avant affichage de l'info-bulle. %d par défaut.

source: %s <FILE> [%s <PREFIX>] Loads the configuration from the file <FILE>, then updates the settings for which there are entries with the prefix <PREFIX>, if any.
fr: %s <FILE> [%s <PREFIX>] Charge la configuration à partir du fichier <FILE>, puis, met à jour les paramètres pour lesquels il y a des entrées avec le préfixe <PREFIX>.

source: %s <FILE>[:<FILE>...] Loads the 1st .desktop file that matches any of the specified (path)names, then setups the command to execute, the icon to display and the tooltip text accordingly.
fr: %s <FILE>[:<FILE>...] Charge le premier fichier .desktop correspondant à un des noms/chemins donnés, puis, configure en conséquence, la commande à exécuter, l'icône à afficher et le texte d'info-bulle.

source: %s <FONT/SIZE> Sets the tooltip font to <FONT> with a size of <SIZE>. Default to %s.
fr: %s <FONT/SIZE> Sélectionne la police <FONT> en taille <SIZE> pour l'info-bulle. %s par défaut.

source: %s <HICOLOR>/<HOVER_HICOLOR>:<LOCOLOR>/<HOVER_LOCOLOR>[:SIZE] Draws a frame with a thickness of <SIZE> pixels around the icon. The top and left borders are painted using color <HICOLOR>, while the bottom and right borders are painted using color <LOCOLOR>. On mouse hovers, the colors <HOVER_HICOLOR> and <HOVER_LOCOLOR> are used instead. When the left mouse button is pressed, the HI/LO colors are swapped, unless when option %s is used. Default to: %s/%s:%s/%s:%d
fr: %s <HICOLOR>/<HOVER_HICOLOR>:<LOCOLOR>/<HOVER_LOCOLOR>[:SIZE] Trace un rectangle d'une épaisseur de <SIZE> pixels autour de l'icône. Les bords supérieur et gauche sont peints avec la couleur <HICOLOR>, alors que les bords inférieur et droit sont peints avec la couleur <LOCOLOR>. Ces couleurs sont remplacées par les couleurs <HOVER_HICOLOR> et <HOVER_LOCOLOR> lors du survole de la souris. Les couleurs HI/LO sont permutées lorsque le bouton gauche de la souris est enfoncé, sauf si l'option %s est utilisée. Configuration par défaut: %s/%s:%s/%s:%d

source: %s <NAME> Sets the display to use to <NAME>.
fr: %s <NAME> Définit <NAME> comme écran du serveur X sur lequel l'application doit s'afficher.

source: %s <PATH>[:<PATH>...] Prepends the given path(s) to the "desktop files" search path.
fr: %s <PATH>[:<PATH>...] Ajoute le(s) chemin(s) spécifié(s) en tête du "chemin de recherche des fichiers .desktop".

source: %s <PATH>[:<PATH>...] Prepends the given path(s) to the fonts search path.
fr: %s <PATH>[:<PATH>...] Ajoute le(s) chemin(s) spécifié(s) en tête du "chemin de recherche de polices".

source: %s <PATH>[:<PATH>...] Prepends the given path(s) to the icons search path.
fr: %s <PATH>[:<PATH>...] Ajoute le(s) chemin(s) spécifié(s) en tête du "chemin de recherche des icônes".

source: %s <SIZE> Sets the padding size around the icon to <SIZE>. Default to %d.
fr: %s <SIZE> Fixe la marge intérieur autout de l'icône à <SIZE>. %d par défaut.

source: %s <SIZE> Sets the padding size around the tooltip text to <SIZE>. Default to %d.
fr: %s <SIZE> Fixe la marge intérieur autout du texte de l'info-bulle à <SIZE>. %d par défaut.

source: %s <SIZE> Sets the tooltip border size to <SIZE>. Default to %d.
fr: %s <SIZE> Fixe la bordure de l'info-bulle à <SIZE>. %d par défaut.

source: %s <SIZE> Sets the window border size to <SIZE>. Default to %d.
fr: %s <SIZE> Fixe la bordure de la fenêtre à <SIZE>. %d par défaut.

source: %s <SIZE> Sets the window size to <SIZE> x <SIZE>. Default to %d.
fr: %s <SIZE> Fixe la taille de la fenêtre à <SIZE> x <SIZE>. %d par défaut.

source: %s <TERM>[:<TERM>...] Sets the list of preferred terminal emulators. The 1st available terminal in this list is used to run the command/application when (1) the option %s is passed in argument, (2) the desktop file passed to option %s includes an entry 'Terminal=true'. By default, the list of preferred terminal emulators is set to : %s.
fr: %s <TERM>[:<TERM>...] Définit la liste des terminaux préférés. Le premier des terminaux de cette liste qui est présent sur le système est utilisé pour exécuter la commande/application lorsque (1) l'option %s est passée en argument, (2) le fichier .desktop passé en argument de l'option %s contient une entrée 'Terminal=true'. Par défaut, la liste des terminaux préférés est : %s.

source: %s <TEXT> Sets the tooltip text to <TEXT>.
fr: %s <TEXT> Définit <TEXT> comme étant le texte de l'info-bulle.

source: %s <VALUE> Sets the icon brightness on mouse hovers to <VALUE>. Default to %f.
fr: %s <VALUE> Fixe la luminosité de l'icône lors du survole de la souris à <VALUE>. %f par défaut.

source: %s <VALUE> Sets the icon brightness to <VALUE>. Default to %f.
fr: %s <VALUE> Fixe la luminosité de l'icône à <VALUE>. %f par défaut.

source: %s <VALUE> Sets the icon contrast on mouse hovers to <VALUE>. Default to %f.
fr: %s <VALUE> Fixe le contraste de l'icône lors du survole de la souris à <VALUE>. %f par défaut.

source: %s <VALUE> Sets the icon contrast to <VALUE>. Default to %f.
fr: %s <VALUE> Fixe le contraste de l'icône à <VALUE>. %f par défaut.

source: %s <VALUE> Sets the icon gamma on mouse hovers to <VALUE>. Default to %f.
fr: %s <VALUE> Fixe la correction gamma de l'icône lors du survole de la souris à <VALUE>. %f par défaut.

source: %s <VALUE> Sets the icon gamma to <VALUE>. Default to %f.
fr: %s <VALUE> Fixe la correction gamma de l'icône à <VALUE>. %f par défaut.

source: %s [<DELAY>] Enables option "double-click to run the command" and sets the double-click timing delay to <DELAY> (Default to %d ms), if any.
fr: %s [<DELAY>] Active l'option "execution de la commande par double-clic" et fixe, le cas échéant, le délai de double-click à <DELAY> ms (%d ms par défaut).

source: %s [<PATH>[:<PATH>...]] Prints information on (default) supported fonts and on fonts accessible from the given path(s), if any.
fr: %s [<PATH>[:<PATH>...]] Affiche des informations sur les polices supportées par défaut, et, le cas échéant, concernant les police(s) accessible(s) à partir du/des chemin(s) spécifiés en arguments.

source: %s: Argument '%s' is missing.
fr: %s: L'argument '%s' est manquant.

source: %s: Argument 'FILE' is missing.
fr: %s: L'argument 'FILE' est manquant.

source: %s: Argument 'NAME' is missing.
fr: %s: L'argument 'NAME' est manquant.

source: %s: Argument 'PREFIX' is missing.
fr: %s: L'argument 'PREFIX' est manquant.

source: %s: Expected 'CMD' is missing.
fr: %s: L'argument 'CMD' est manquant.

source: ...fall back to default font '%s'
fr: ...sélection de la police par défaut '%s'

source: Argument '%s' is missing.
fr: L'argument '%s' est manquant.

source: Error, .desktop file '%s' does not exist.
fr: Erreur, le fichier .desktop '%s' n'existe pas.

source: Error, Expected '%s=<value>' is missing in configuration file %s
fr: Erreur, l'entrée '%s=<value>' n'a pas été trouvée dans le fichier de configuration %s

source: Error, No .desktop file match any of the specified (path)names: %s
fr: Erreur, aucun ficher .desktop ne correspond au chemin(s)/nom(s) : %s

source: Expected '%s=<value>' is missing in configuration file %s
fr: L'entrée '%s=<value>' n'a pas été trouvée dans le fichier de configuration %s

source: Failed to load %s
fr: Echec du chargement de %s

source: Failed to load configuration file '%s'. Error #%d
fr: Echec de chargement du fichier de configuration '%s'. Erreur #%d

source: Failed to load font %s...
fr: Echec de chargement de la police %s...

source: Failed to load icon %s. Imlib Error code %d.
fr: Echec de chargement de l'icône %s. Erreur Imlib %d.

source: Failed to run %s. Error %d: %s
fr: Echec de l'exécution de %s. Erreur %d: %s

source: Font paths :
fr: Chemin(s) de polices :

source: For more detailed informations, read the man page : $ man wmalauncher
fr: Pour de plus amples informations, consulter la page du manuel : $ man wmalauncher

source: OPTIONS:
fr: LES OPTIONS:

source: Unexpected argument '%s'
fr: Argument inattendu '%s'

source: Unexpected option '%s'.
fr: Option inattendue '%s'.

source: Unrecognized option '%s'.
fr: Option non reconnue '%s'.

source: Warning, entry ignored at line #%d in file %s. The key '%s' is already assigned.
fr: Attention, entrée ignorée à la ligne #%d du fichier %s. La clé '%s' est déjà affectée.

source: [%s] Warning, <HICOLOR/HOVER_HICOLOR> is missing. Default to '%s/%s'.
fr: [%s] Attention, les paramètres <HICOLOR/HOVER_HICOLOR> sont manquant. '%s/%s' par défaut.

source: [%s] Warning, <HICOLOR> is missing. Default to '%s'.
fr: [%s] Attention, le paramètre <HICOLOR> est manquant. '%s' par défaut.

source: [%s] Warning, <HOVER_HICOLOR> is missing. Default to '%s'.
fr: [%s] Attention, le paramètre <HOVER_HICOLOR> est manquant. '%s' par défaut.

source: [%s] Warning, <HOVER_LOCOLOR> is missing. Default to '%s'.
fr: [%s] Attention, le paramètre <HOVER_LOCOLOR> est manquant. '%s' par défaut.

source: [%s] Warning, <LOCOLOR/HOVER_LOCOLOR> is missing. Default to '%s/%s'.
fr: [%s] Attention, les paramètres <LOCOLOR/HOVER_LOCOLOR> sont manquant. '%s/%s' par défaut.

source: [%s] Warning, <LOCOLOR> is missing. Default to '%s'.
fr: [%s] Attention, le paramètre <LOCOLOR> est manquant. '%s' par défaut.

source: [%s] Warning, border size %d is to high. Set to %d
fr: [%s] Attention, la taille de bordure (%d) est trop importante. Ajustée à %d

source: [%s] Warning, frame thickness %d is to high. Set to %d
fr: [%s] Attention, l'épaisseur du cadre (%d) est trop important. Ajustée à: %d

source: [%s] Warning, icon padding %d is to high. Set to %d
fr: [%s] Attention, la marge intérieure (%d) est trop importante. Ajustée à %d

source: [%s] Warning, invalid delay '%s'. Must be an integer in range [%d..%d]. Default to: %d.
fr: [%s] Attention, Le délai '%s' n'est pas valide. Ce doit être un entier dans l'intervalle [%d..%d]. %d par défaut.

source: [%s] Warning, invalid size '%s'. Must be an integer >=1. Default to: %d.
fr: [%s] Attention, la taille '%s' n'est pas valide. Doit être un entier >=1. %d par défaut.

source: [%s] Warning, invalid size '%s'. Must be an integer in range [%d..%d]. Default to: %d.
fr: [%s] Attention, la taille '%s' n'est pas valide. Ce doit être un entier dans l'intervalle [%d..%d]. %d par défaut.

source: [%s] Warning, invalid thickness '%s'. Must be >0. Reset to %d.
fr: [%s] Attention, la valeur d'épaisseur '%s' n'est pas valide. Doit être >0. %d par défaut.

source: [%s] Warning, invalid timing delay '%s'. Must be an integerin range [%d..%d]. Default to: %d.
fr: [%s] Attention, le valeur de délai '%s' n'est pas valide. Doit être un entier dans l'intervalle [%d..%d]. %d par défaut.

source: [%s] Warning, invalid value '%s'. Must be a float >= %f. Default to: %f.
fr: [%s] Attention, la valeur '%s' n'est pas valide. Doit être un flottant >= %f. %f par défaut.

source: [%s] Warning, invalid value '%s'. Must be a float. Default to: %f.
fr: [%s] Attention, la valeur '%s' n'est pas valide. Doit être un flottant. %f par défaut.

source: [%s] Warning, missing size in font spec. '%s'. Default to: %s
fr: [%s] Attention, la spécification de police '%s' n'a pas de champ /<SIZE>. %s par défaut.

source: [%s] Warning, reset border size and icon padding to their default value.
fr: [%s] Attention, réinitialisation de la taille de bodure et de la marge intérieure.

source: [%s] Warning, reset border size, icon padding and frame thickness to their default value.
fr: [%s] Attention, réinitialisation de la taille de bordure, de la marge intérieure, et de l'épaisseur de cadre.

source: [%s] Warning, reset border size, icon padding and frame thicknessto their default value.
fr: [%s] Attention, réinitialisation de la taille de bordure, de la marge intérieure, et de l'épaisseur de cadre.

source: [%s] Warning, unrecognized value '%s'. Default to '%s'.
fr: [%s] Attention, '%s': valeur non reconnue. '%s' par défaut.

source: [%s] Warning. invalid size '%s'. Must be an integer >=0. Default to: %d.
fr: [%s] Attention. la taille '%s' n'est pas valide. Doit être un entier >=0. %d par défaut.

source: [OPTION] can be :
fr: [OPTION] peut être :

source: disable tooltip support.
fr: Désactivation de l'info-bulle.
